<?php

use yii\db\Migration;

/**
 * Handles the creation of table `{{%colors}}`.
 */
class m190304_083532_create_colors_table extends Migration
{
    /**
     * {@inheritdoc}
     */
    public function safeUp()
    {
        $tableOptions = null;
        if ($this->db->driverName === 'mysql') {
            $tableOptions = 'CHARACTER SET utf8 COLLATE utf8_unicode_ci ENGINE=InnoDB';
        }

        $this->createTable('{{%colors}}', [
            'id' => $this->primaryKey(),
            'name' => $this->string()->notNull(),
            'rgb' => $this->string()->notNull(),
            'hex' => $this->string()->notNull(),
        ], $tableOptions);

        $this->batchInsert('{{%colors}}', ['name', 'rgb', 'hex'], [
            ['Тёмно-бордовый', 'rgb(128,0,0)', '#800000'],
            ['Тёмно-красный', 'rgb(139,0,0)', '#8B0000'],
            ['Огнеупорный кирпич', 'rgb(178,34,34)', '#B22222'],
            ['Красный', 'rgb(255,0,0)', '#FF0000'],
            ['Лососевый', 'rgb(250,128,114)', '#FA8072'],
            ['Томатный', 'rgb(255,99,71)', '#FF6347'],
            ['Коралловый', 'rgb(255,127,80)', '#FF7F50'],
            ['Оранжево-красный', 'rgb(255,69,0)', '#FF4500'],
            ['Шоколадный', 'rgb(210,105,30)', '#D2691E'],
            ['Песочно-коричневый', 'rgb(244,164,96)', '#F4A460'],
            ['Тёмно-оранжевый', 'rgb(255,140,0)', '#FF8C00'],
            ['Оранжевый', 'rgb(255,165,0)', '#FFA500'],
            ['Тёмный золотарник', 'rgb(184,134,11)', '#B8860B'],
            ['Золотарниковый', 'rgb(218,165,32)', '#DAA520'],
            ['Золотой', 'rgb(255,215,0)', '#FFD700'],
            ['Оливковый', 'rgb(128,128,0)', '#808000'],
            ['Жёлтый', 'rgb(255,255,0)', '#FFFF00'],
            ['Жёлто-зелёный', 'rgb(154,205,50)', '#9ACD32'],
            ['Зелёно-жёлтый', 'rgb(173,255,47)', '#ADFF2F'],
            ['Шартрёз (ликёр)', 'rgb(127,255,0)', '#7FFF00'],
            ['Зелёный газон', 'rgb(124,252,0)', '#7CFC00'],
            ['Зелёный', 'rgb(0,128,0)', '#008000'],
            ['Лаймовый', 'rgb(0,255,0)', '#00FF00'],
            ['Зелёный лайм', 'rgb(50,205,50)', '#32CD32'],
            ['Весенне зелёный', 'rgb(0,255,127)', '#00FF7F'],
            ['Весенне-зелёный нейтральный', 'rgb(0,250,154)', '#00FA9A'],
            ['Бирюзовый', 'rgb(64,224,208)', '#40E0D0'],
            ['Светло-зелёное море', 'rgb(32,178,70)', '#20B2AA'],
            ['Бирюзовый нейтральный', 'rgb(72,209,204)', '#48D1CC'],
            ['Тёмный циан', 'rgb(0,139,139)', '#008B8B'],
            ['Морская волна', 'rgb(0,255,255)', '#00FFFF'],
            ['Тёмно-бирюзовый', 'rgb(0,206,209)', '#00CED1'],
            ['Небесно-голубой тёмный', 'rgb(0,191,255)', '#00BFFF'],
            ['Обманчивый синий', 'rgb(30,144,255)', '#1E90FF'],
            ['Королевский синий', 'rgb(65,105,225)', '#4169E1'],
            ['Военно-морского флота', 'rgb(0,0,128)', '#000080'],
            ['Тёмно-синий', 'rgb(0,0,139)', '#00008B'],
            ['Cиний нейтральный', 'rgb(0,0,205)', '#0000CD'],
            ['Синий', 'rgb(0,0,255)', '#0000FF'],
            ['Сине-фиолетовый', 'rgb(138,43,226)', '#8A2BE2'],
            ['Тёмная орхидея', 'rgb(153,50,204)', '#9932CC'],
            ['Тёмно-фиолетовый', 'rgb(148,0,211)', '#9400D3'],
            ['Фиолетовый', 'rgb(128,0,128)', '#800080'],
            ['Тёмный маджента', 'rgb(139,0,139)', '#8B008B'],
            ['Маджента', 'rgb(255,0,255)', '#FF00FF'],
            ['Фиолетово-красный нейтральный', 'rgb(199,21,133)', '#C71585'],
            ['Насыщенный розовый', 'rgb(255,20,147)', '#FF1493'],
            ['Ярко-розовый', 'rgb(255,105,80)', '#FF69B4'],
            ['Малиновый', 'rgb(220,20,60)', '#DC143C'],
            ['Коричневый', 'rgb(165,42,42)', '#A52A2A'],
            ['Красный индийский', 'rgb(205,92,92)', '#CD5C5C'],
            ['Розово-коричневый', 'rgb(188,143,143)', '#BC8F8F'],
            ['Светло-коралловый', 'rgb(240,128,128)', '#F08080'],
            ['Снег', 'rgb(255,250,250)', '#FFFAFA'],
            ['Туманная роза', 'rgb(255,228,225)', '#FFE4E1'],
            ['Тёмный лосось', 'rgb(233,150,122)', '#E9967A'],
            ['Светлый лосось', 'rgb(255,160,122)', '#FFA07A'],
            ['Охра', 'rgb(160,82,45)', '#A0522D'],
            ['Морская ракушка', 'rgb(255,245,238)', '#FFF5EE'],
            ['Седло Браун', 'rgb(139,69,19)', '#8B4513'],
            ['Персиковая пудра', 'rgb(255,218,185)', '#FFDAB9'],
            ['Перу', 'rgb(205,133,63)', '#CD853F'],
            ['Текстильный', 'rgb(250,240,230)', '#FAF0E6'],
            ['Бисквит', 'rgb(255,228,196)', '#FFE4C4'],
            ['Плотное дерево', 'rgb(222,184,135)', '#DEB887'],
            ['Загар', 'rgb(210,180,140)', '#D2B48C'],
            ['Античный белый', 'rgb(255,235,215)', '#FAEBD7'],
            ['Белый навахо', 'rgb(255,222,173)', '#FFDEAD'],
            ['Бланшированный миндаль', 'rgb(255,235,205)', '#FFEBCD'],
            ['Побег папайи', 'rgb(255,239,213)', '#FFEFD5'],
            ['Мокасиновый', 'rgb(255,228,181)', '#FFE4B5'],
            ['Пшеничный', 'rgb(245,222,179)', '#F5DEB3'],
            ['Старое кружево', 'rgb(253,245,230)', '#FDF5E6'],
            ['Цветочный белый', 'rgb(255,250,240)', '#FFFAF0'],
            ['Кукурузный волос', 'rgb(255,248,220)', '#FFF8DC'],
            ['Хаки', 'rgb(240,230,140)', '#F0E68C'],
            ['Лимонный шифон', 'rgb(255,250,205)', '#FFFACD'],
            ['Бледный золотарник', 'rgb(238,232,170)', '#EEE8AA'],
            ['Тёмный хаки', 'rgb(189,183,107)', '#BDB76B'],
            ['Бежевый', 'rgb(245,245,220)', '#F5F5DC'],
            ['Светло-жёлтый золотарник', 'rgb(250,250,210)', '#FAFAD2'],
            ['Светло-жёлтый', 'rgb(255,255,224)', '#FFFFE0'],
            ['Слоновая кость', 'rgb(255,255,240)', '#FFFFF0'],
            ['Тёмно-оливковый', 'rgb(107,142,35)', '#6B8E23'],
            ['Тёмно-оливковый зелёный', 'rgb(85,107,47)', '#556B2F'],
            ['Тёмно-зелёное море', 'rgb(143,188,143)', '#8FBC8F'],
            ['Тёмно-зелёный', 'rgb(0,100,0)', '#006400'],
            ['Зелёный лесной', 'rgb(34,139,34)', '#228B22'],
            ['Светло-зелёный', 'rgb(144,238,144)', '#90EE90'],
            ['Бледно-зелёный', 'rgb(152,251,152)', '#98FB98'],
            ['Медвяная роса', 'rgb(240,255,240)', '#F0FFF0'],
            ['Зелёное море', 'rgb(46,139,87)', '#2E8B57'],
            ['Зелёное море, нейтральный', 'rgb(60,179,113)', '#3CB371'],
            ['Мятный крем', 'rgb(245,255,250)', '#F5FFFA'],
            ['Аквамариновый нейтральный', 'rgb(102,205,170)', '#66CDAA'],
            ['Аквамариновый', 'rgb(127,255,212)', '#7FFFD4'],
            ['Тёмный грифельно-серый', 'rgb(47,79,79)', '#2F4F4F'],
            ['Бледно-бирюзовый', 'rgb(179,238,238)', '#AFEEEE'],
            ['Светло-голубой', 'rgb(224,255,255)', '#E0FFFF'],
            ['Лазурный', 'rgb(245,255,255)', '#F0FFFF'],
            ['Серо-синий', 'rgb(95,158,160)', '#5F9EA0'],
            ['Пыльный голубой', 'rgb(176,224,230)', '#B0E0E6'],
            ['Светло-синий', 'rgb(173,216,230)', '#ADD8E6'],
            ['Небесно-голубой', 'rgb(135,206,235)', '#87CEEB'],
            ['Небесно-голубой светлый', 'rgb(135,206,250)', '#87CEFA'],
            ['Синяя сталь', 'rgb(70,130,180)', '#4682B4'],
            ['Синяя Элис', 'rgb(240,248,255)', '#F0F8FF'],
            ['Серый шифер', 'rgb(112,128,144)', '#708090'],
            ['Светло-серый шифер', 'rgb(119,136,153)', '#778899'],
            ['Светло-стальной синий', 'rgb(176,196,222)', '#B0C4DE'],
            ['Васильковый голубой', 'rgb(100,149,237)', '#6495ED'],
            ['Лаванда', 'rgb(230,230,250)', '#E6E6FA'],
            ['Призрачно-белый', 'rgb(248,248,255)', '#F8F8FF'],
            ['Полуночный синий', 'rgb(25,25,112)', '#191970'],
            ['Аспидно-синий', 'rgb(106,90,205)', '#6A5ACD'],
            ['Тёмный аспидно-синий', 'rgb(72,61,139)', '#483D8B'],
            ['Нейтральный аспидно-синий', 'rgb(123,104,238)', '#7B68EE'],
            ['Фиолетовый нейтральный', 'rgb(147,112,219)', '#9370DB'],
            ['Индиго', 'rgb(75,0,130)', '#4B0082'],
            ['Нейтральный цвет орхидеи', 'rgb(186,85,211)', '#BA55D3'],
            ['Слива светлая', 'rgb(221,160,221)', '#DDA0DD'],
            ['Розово-фиолетовый', 'rgb(238,130,238)', '#EE82EE'],
            ['Чертополох', 'rgb(216,191,216)', '#D8BFD8'],
            ['Орхидея', 'rgb(218,112,214)', '#DA70D6'],
            ['Розово-лавандовый', 'rgb(255,240,245)', '#FFF0F5'],
            ['Лиловый', 'rgb(219,112,147)', '#DB7093'],
            ['Розовый', 'rgb(255,192,203)', '#FFC0CB'],
            ['Светло-розовый', 'rgb(255,182,193)', '#FFB6C1'],
            ['Чёрный', 'rgb(0,0,0)', '#000000'],
            ['Тускло-серый', 'rgb(105,105,105)', '#696969'],
            ['Серый', 'rgb(128,128,128)', '#808080'],
            ['Тёмно-серый', 'rgb(169,169,169)', '#A9A9A9'],
            ['Серебряный', 'rgb(192,192,192)', '#C0C0C0'],
            ['Светло-серый', 'rgb(211,211,211)', '#D3D3D3'],
            ['Геинсборо', 'rgb(220,220,220)', '#DCDCDC'],
            ['Белый дым', 'rgb(245,245,245)', '#F5F5F5'],
            ['Белый', 'rgb(255,255,255)', '#FFFFFF'],
        ]);
    }


    /**
     * {@inheritdoc}
     */
    public function safeDown()
    {
        $this->dropTable('{{%colors}}');
    }
}
